---
kind: other
id: Properties.T:Autodesk.Revit.DB.IFC.IFCTransaction
source: html/bc88287d-936d-63d4-c5fa-8071e014e0a6.htm
---
# IFCTransaction Properties

Specifies whether the .NET object represents a valid Revit entity.